Table of Contents
 Class Point2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents an x- and y-coordinate pair in two-dimensional space.
[OpenModelClass("System.Windows.Point, WindowsBase")]
[DataContract]
public class Point2D : OpenObject
Inheritance
object
OpenObject
Point2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 X
Gets or sets the X-coordinate value
[DataMember]
public double X { get; set; }
Property Value
double
 Y
Gets or sets the Y-coordinate value
[DataMember]
public double Y { get; set; }
Property Value
double
 Edit this page